//
//  Recipes.swift
//  AspaZ
//
//  Created by Riza on 12/24/20.
//

import Foundation

struct RecipesDataModel {
    
    let baursak = Recipe(name: "Бауырсақ", recipe: "Бауырсақ\n\nҰн - 350 гр\nСүт - 200 мл\nАшытқы - 1 шай қасық\nШекер - 1 шай қасық\nТұз - 0,5 шай қасық (жарты шай қасық)\nСұйық май - 2-3 ас қасық\n\nЖасалу тәсілі:\nҮлкендеу табаққа шекерді ашытқыны салып үстіне сүтті жылытып құйыңыз да 10 минтуқа қалдырыңыз. 10 минуттан соң тұзды салыңыз, сұйық майды құйып араластырыңыз, ұнды салып жұмсақтау қамыр илеңіз. Қамыр қолға жабыспайтындай етіп жақсылап илеп болған соң, жылы орап қойыңыз. 30-40 минуттан соң бір рет қайыра илеп, 10-15 минутқа қалдырыңыз. Дайын болған қамырды алып қалыңдығын 1 см етіп жайыңыз да майдалап кесіңіз немесе ойғышпен дөңгелектеп ойыңыз, көпсу үшін 10 минутқа орамалмен бетін жауып қойыңыз. Оған дейін шұңғылдау ыдысқа сұйық майды құйып қыздырыңыз, бауырсақ бататындай болсын, сонда тегіс қызарып әдемі болып піседі.")
    
    let kuyrdak = Recipe(name: "Қуырдақ", recipe: "Жылқы етінің қуырдағы\n\n1 килогратм ет\n300 грамм жылқы майы\n2 пияз\nЖарты шай қасық бұрыш\n2 шай қасық тұз.\n\nЖасалу тәсілі:\nБұл - өте дәмді қуырдақ. Оның үстіне жылқы еті адам организміне аса жұғымды, бойға сіңімді келеді. Өзі жеңіл қорытылады.\nЕт ұсақтап туралады. Ол қыздырылған қазанға жылқының ұсақтап туралып салынған немесе алдын-ала ерітіп алынған іш майына қуырылады. Өйткені жылқы майы қатып, таңдайға да, ерінге де жабыспайды әрі ол басқа майға қарағанда сіңімді болады.Май еріген соң үстіне манағы туралған ет салынып, сәл қуырылған соң, сақиналап кесілген пияз қосылады. Тұздалып, бұрышталады. Табылса - сорпа, табылмаса - су құйылады да, қазанның қақпағы жабылып, бұқтырылады.Піскеннен кейін қуырдақ сүзіп алынады. Сөйтіп жайпақ ыдыспен дастарқанға әкелінеді. Майын бөлек ыдысқа, мәселен, кесеге құйып беруге болады. Кейбір кісілер қуырдақтың майын сүйсініп ішеді. Өйткені ол жүрекке тимейді. Қуырдақты өз майына бөктіріп берсе де болады.")
    
    let besh = Recipe(name: "Бешбармақ", recipe: "Ет немесе Қазақша ет (кей өңірде ауызекі тілде Бешбармақ) – қазақ халқының еттен дайындалатын ұлттық тағамы.\nТойға немесе қонақасыға көбінесе қой сойылады. Қой еті жіліктегенде 13 мүшеге бөлінеді. Олар:\nжамбас – 2,\nортан жілік – 2,\nасықты жілік – 2,\nбел омыртқа – 1,\nсүбе – 2 (сүбемен бірге бүйректен жоғарғы 5 қабырға кетеді),\nқабырға – 2,\nтөс – 1,\nомыртқа – 1,\nжауырын – 2,\nтоқпан жілік – 2,\nкәрі жілік – 2,\nбұғана – 1,\nмойын – 1.\nАталған мүшелер адамдардың жас, жыныс және әлеуметтік ерекшелігіне сай тартылады немесе керісінше, жеуіне тыйым салынды.\n\nДайындалуы\nАсуға дайындалған етті жуып-шайып тазалап, қазанға салады да, ет батып тұратындай етіп суық су құяды. Содан кейін қазанды қатты жанған отқа қойып, сарқылдатып қайнатады, бетіне шыққан қанды көбігін алып тастап, шамалап тұз, кейде пияз салып, отын басады да, 1 – 1,5 сағат ет әбден піскенше шымырлатып қайнатады.\nЕт піскен соң сорпасынан бөліп алып, тартылатын табақтың санына қарай мөлшерлеп, тұздық әзірлейді. Ол үшін сорпаға қара бұрыш, дөңгелектеп туралған пияз салып, ыдыстың бетін жауып, бұқтырып қояды. Ет туралып болған соң, тұздықты еттің үстіне құяды. Қазақша етке қамыр, бітеу пісірілген картоп, сәбіз қосуға болады.")
}
